// ===============================
// 問題2: 自動販売機のお釣りを表示するプログラムを作成してください
//
//　　　　＜要件＞ 
// 　　　　　・コマンドライン引数に以下のルールを適用
// 　　　　　　- 最後に入力されたコマンドライン引数：購入された商品の値段
// 　　　　　　- それ以外：投入された硬貨
// 
// 　　　　　・投入されたお金が、10円玉、50円玉、100円玉、500円玉の合計金額を以下のように表示する
// 　　　　　　- ただ今の投入金額は（合計金額の値）円です
// 　　　　　・1円玉、5円玉が投入された場合は、合計金額に含めず、以下のように表示する
// 　　　　　　- 警告：1円玉は使えません / 警告：5円玉は使えません
// 　　　　　・硬貨としてふさわしくない値は合計金額に含めず、以下のように表示する
// 　　　　　　- 警告：（入力された値）は硬貨として適切な値ではありません
// 　　　　　　- 例）入力値が55のとき→警告：55は硬貨として適切な値ではありません
// 
// 　　　　　・投入された硬貨の合計金額から購入された商品の値段を差し引いて、以下のようにお釣りのメッセージを表示する
// 　　　　　　- （お釣りの金額）円のお釣りです。ありがとうございました。
// ===============================

public class Question2 {

    public static void main(String[] args) {
        // ここにコードを記述してください
    }
}
