// ===============================
// 問題5: 自動販売機に投入された硬貨の合計金額を表示するプログラムを作成してください
//
//　　　　＜要件＞ 
// 　　　　　・投入されたお金が、10円玉、50円玉、100円玉、500円玉の合計金額を以下のように表示する
// 　　　　　　- ただ今の投入金額は（合計金額の値）円です
// 　　　　　・1円玉、5円玉が投入された場合は、合計金額に含めず、以下のように表示する
// 　　　　　　- 警告：1円玉は使えません / 警告：5円玉は使えません
// 　　　　　・硬貨としてふさわしくない値は合計金額に含めず、以下のように表示する
// 　　　　　　- 警告：（入力された値）は硬貨として適切な値ではありません
// 　　　　　　- 例）入力値が55のとき→警告：55は硬貨として適切な値ではありません
// ===============================

public class Question5 {

    public static void main(String[] args) {
        // ここにコードを記述してください
    }
}
